## Plan Result (ptlsbox-jenkins)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;pact&#34;]
  * module.postgresql.azurerm_resource_group.rg[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "cft-pact-broker-ptlsbox"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "cft-pact-broker-data-ptlsbox"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "2023-01-01"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "cft-pact-broker-data-ptlsbox"
      + server_name         = "cft-pact-broker-ptlsbox"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["pact"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "pact"
      + server_id = (known after apply)
    }

  # module.postgresql.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cft-pact-broker-data-ptlsbox"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "2023-01-01"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server has been deleted
  - resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_login           = "pgadmin" -> null
      - administrator_password        = (sensitive value)
      - fqdn                          = "cft-pact-broker-ptlsbox.postgres.database.azure.com" -> null
      - id                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-pact-broker-data-ptlsbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-pact-broker-ptlsbox" -> null
      - name                          = "cft-pact-broker-ptlsbox" -> null
      - resource_group_name           = "cft-pact-broker-data-ptlsbox" -> null
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-01-01"
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.postgresql.azurerm_resource_group.rg[0] has been deleted
  - resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-pact-broker-data-ptlsbox"
      - location = "uksouth" -> null
      - name     = "cft-pact-broker-data-ptlsbox" -> null
        tags     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-01-01"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"ptlsbox-jenkins","Vars":{}} -->